In [1]:
import pandas as pd

In [8]:
dict2 = {
    "name" : ["Roshith","Ramesh","Sandhya","Rohan"],
    "age"  : [20,50,40,14],
    "occupation" : ["Student","Govt Employee","Teacher","Student"],
    "Salary" : [1000,120000,15000,100]
}

In [9]:
df2 = pd.DataFrame(dict2)

In [10]:
df2

      name  age     occupation  Salary
0  Roshith   20        Student    1000
1   Ramesh   50  Govt Employee  120000
2  Sandhya   40        Teacher   15000
3    Rohan   14        Student     100

In [12]:
df2.to_csv('Family2.csv',index = False)

In [13]:
df2.describe()

           age         Salary
count   4.0000       4.000000
mean   31.0000   34025.000000
std    16.8523   57721.190505
min    14.0000     100.000000
25%    18.5000     775.000000
50%    30.0000    8000.000000
75%    42.5000   41250.000000
max    50.0000  120000.000000

In [32]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
a1 = np.array([1,2,3,4,5,6,7,8,9,10])

In [16]:
a1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [18]:
a1.sum()

55

In [28]:
a1.mean()

5.5

In [29]:
d1 = {
    "Company" : ["Amazon","Microsoft","Adobe","Continental"],
    "Sales" : [100,345,400,600],
    "Profits" : [0.03,0.04,0.009,0.1]
}

In [49]:
dfd1 = pd.DataFrame(d1)

In [47]:
dfd1

       Company  Sales  Profits
0       Amazon    100    0.030
1    Microsoft    345    0.040
2        Adobe    400    0.009
3  Continental    600    0.100

In [50]:
dfd1.to_csv('Company.csv',index = False)